----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]             192
       BatchNorm2d-2         [-1, 64, 224, 224]             128
              SiLU-3         [-1, 64, 224, 224]               0
              SiLU-4         [-1, 64, 224, 224]               0
              SiLU-5         [-1, 64, 224, 224]               0
              SiLU-6         [-1, 64, 224, 224]               0
              SiLU-7         [-1, 64, 224, 224]               0
              SiLU-8         [-1, 64, 224, 224]               0
              SiLU-9         [-1, 64, 224, 224]               0
             Conv-10         [-1, 64, 224, 224]               0
           Conv2d-11         [-1, 32, 224, 224]             288
      BatchNorm2d-12         [-1, 32, 224, 224]              64
             SiLU-13         [-1, 32, 224, 224]               0
             SiLU-14         [-1, 32, 224, 224]               0
             SiLU-15         [-1, 32, 224, 224]               0
             SiLU-16         [-1, 32, 224, 224]               0
             SiLU-17         [-1, 32, 224, 224]               0
             SiLU-18         [-1, 32, 224, 224]               0
             SiLU-19         [-1, 32, 224, 224]               0
             Conv-20         [-1, 32, 224, 224]               0
           Conv2d-21         [-1, 64, 224, 224]           2,048
      BatchNorm2d-22         [-1, 64, 224, 224]             128
             SiLU-23         [-1, 64, 224, 224]               0
             SiLU-24         [-1, 64, 224, 224]               0
             SiLU-25         [-1, 64, 224, 224]               0
             SiLU-26         [-1, 64, 224, 224]               0
             SiLU-27         [-1, 64, 224, 224]               0
             SiLU-28         [-1, 64, 224, 224]               0
             SiLU-29         [-1, 64, 224, 224]               0
             Conv-30         [-1, 64, 224, 224]               0
           Conv2d-31         [-1, 64, 224, 224]             576
      BatchNorm2d-32         [-1, 64, 224, 224]             128
             SiLU-33         [-1, 64, 224, 224]               0
             SiLU-34         [-1, 64, 224, 224]               0
             SiLU-35         [-1, 64, 224, 224]               0
             SiLU-36         [-1, 64, 224, 224]               0
             SiLU-37         [-1, 64, 224, 224]               0
             SiLU-38         [-1, 64, 224, 224]               0
             SiLU-39         [-1, 64, 224, 224]               0
             Conv-40         [-1, 64, 224, 224]               0
           Conv2d-41         [-1, 32, 224, 224]           2,048
      BatchNorm2d-42         [-1, 32, 224, 224]              64
             SiLU-43         [-1, 32, 224, 224]               0
             SiLU-44         [-1, 32, 224, 224]               0
             SiLU-45         [-1, 32, 224, 224]               0
             SiLU-46         [-1, 32, 224, 224]               0
             SiLU-47         [-1, 32, 224, 224]               0
             SiLU-48         [-1, 32, 224, 224]               0
             SiLU-49         [-1, 32, 224, 224]               0
             Conv-50         [-1, 32, 224, 224]               0
           Conv2d-51         [-1, 32, 224, 224]             288
      BatchNorm2d-52         [-1, 32, 224, 224]              64
             SiLU-53         [-1, 32, 224, 224]               0
             SiLU-54         [-1, 32, 224, 224]               0
             SiLU-55         [-1, 32, 224, 224]               0
             SiLU-56         [-1, 32, 224, 224]               0
             SiLU-57         [-1, 32, 224, 224]               0
             SiLU-58         [-1, 32, 224, 224]               0
             SiLU-59         [-1, 32, 224, 224]               0
             Conv-60         [-1, 32, 224, 224]               0
              CIB-61         [-1, 32, 224, 224]               0
           Conv2d-62         [-1, 64, 224, 224]           6,144
      BatchNorm2d-63         [-1, 64, 224, 224]             128
             SiLU-64         [-1, 64, 224, 224]               0
             SiLU-65         [-1, 64, 224, 224]               0
             SiLU-66         [-1, 64, 224, 224]               0
             SiLU-67         [-1, 64, 224, 224]               0
             SiLU-68         [-1, 64, 224, 224]               0
             SiLU-69         [-1, 64, 224, 224]               0
             SiLU-70         [-1, 64, 224, 224]               0
             Conv-71         [-1, 64, 224, 224]               0
================================================================
Total params: 12,288
Trainable params: 12,288
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 1359.75
Params size (MB): 0.05
Estimated Total Size (MB): 1360.37
----------------------------------------------------------------
