----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]             192
       BatchNorm2d-2         [-1, 64, 224, 224]             128
              SiLU-3         [-1, 64, 224, 224]               0
              SiLU-4         [-1, 64, 224, 224]               0
              SiLU-5         [-1, 64, 224, 224]               0
              SiLU-6         [-1, 64, 224, 224]               0
              Conv-7         [-1, 64, 224, 224]               0
            Conv2d-8         [-1, 16, 224, 224]           4,608
       BatchNorm2d-9         [-1, 16, 224, 224]              32
             SiLU-10         [-1, 16, 224, 224]               0
             SiLU-11         [-1, 16, 224, 224]               0
             SiLU-12         [-1, 16, 224, 224]               0
             SiLU-13         [-1, 16, 224, 224]               0
             Conv-14         [-1, 16, 224, 224]               0
           Conv2d-15         [-1, 32, 224, 224]           4,608
      BatchNorm2d-16         [-1, 32, 224, 224]              64
             SiLU-17         [-1, 32, 224, 224]               0
             SiLU-18         [-1, 32, 224, 224]               0
             SiLU-19         [-1, 32, 224, 224]               0
             SiLU-20         [-1, 32, 224, 224]               0
             Conv-21         [-1, 32, 224, 224]               0
       Bottleneck-22         [-1, 32, 224, 224]               0
           Conv2d-23         [-1, 64, 224, 224]           6,144
      BatchNorm2d-24         [-1, 64, 224, 224]             128
             SiLU-25         [-1, 64, 224, 224]               0
             SiLU-26         [-1, 64, 224, 224]               0
             SiLU-27         [-1, 64, 224, 224]               0
             SiLU-28         [-1, 64, 224, 224]               0
             Conv-29         [-1, 64, 224, 224]               0
================================================================
Total params: 15,904
Trainable params: 15,904
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 483.88
Params size (MB): 0.06
Estimated Total Size (MB): 484.51
----------------------------------------------------------------
