----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 3, 224, 224]              27
       BatchNorm2d-2          [-1, 3, 224, 224]               6
              SiLU-3          [-1, 3, 224, 224]               0
              SiLU-4          [-1, 3, 224, 224]               0
              SiLU-5          [-1, 3, 224, 224]               0
              SiLU-6          [-1, 3, 224, 224]               0
              SiLU-7          [-1, 3, 224, 224]               0
              Conv-8          [-1, 3, 224, 224]               0
            Conv2d-9         [-1, 64, 224, 224]             192
      BatchNorm2d-10         [-1, 64, 224, 224]             128
             SiLU-11         [-1, 64, 224, 224]               0
             SiLU-12         [-1, 64, 224, 224]               0
             SiLU-13         [-1, 64, 224, 224]               0
             SiLU-14         [-1, 64, 224, 224]               0
             SiLU-15         [-1, 64, 224, 224]               0
             Conv-16         [-1, 64, 224, 224]               0
           Conv2d-17         [-1, 64, 224, 224]             576
      BatchNorm2d-18         [-1, 64, 224, 224]             128
             SiLU-19         [-1, 64, 224, 224]               0
             SiLU-20         [-1, 64, 224, 224]               0
             SiLU-21         [-1, 64, 224, 224]               0
             SiLU-22         [-1, 64, 224, 224]               0
             SiLU-23         [-1, 64, 224, 224]               0
             Conv-24         [-1, 64, 224, 224]               0
           Conv2d-25         [-1, 64, 224, 224]           4,096
      BatchNorm2d-26         [-1, 64, 224, 224]             128
             SiLU-27         [-1, 64, 224, 224]               0
             SiLU-28         [-1, 64, 224, 224]               0
             SiLU-29         [-1, 64, 224, 224]               0
             SiLU-30         [-1, 64, 224, 224]               0
             SiLU-31         [-1, 64, 224, 224]               0
             Conv-32         [-1, 64, 224, 224]               0
           Conv2d-33         [-1, 64, 224, 224]             576
      BatchNorm2d-34         [-1, 64, 224, 224]             128
             SiLU-35         [-1, 64, 224, 224]               0
             SiLU-36         [-1, 64, 224, 224]               0
             SiLU-37         [-1, 64, 224, 224]               0
             SiLU-38         [-1, 64, 224, 224]               0
             SiLU-39         [-1, 64, 224, 224]               0
             Conv-40         [-1, 64, 224, 224]               0
================================================================
Total params: 5,985
Trainable params: 5,985
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 793.19
Params size (MB): 0.02
Estimated Total Size (MB): 793.78
----------------------------------------------------------------
